<details ><summary>apply for monitoring 2024-12-23 08:34:26 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/testing.pinner.xyz-devops#monitoring has been locked by PR #5
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.grafana will be created
  + resource "cloudns_dns_record" "grafana" {
      + id    = (known after apply)
      + name  = (known after apply)
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # module.grafana.module.grafana_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.grafana.module.grafana_deployment.akash_deployment.service: Creating...
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Creation complete after 23s [id=19476797:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.grafana: Creating...
cloudns_dns_record.grafana: Creation complete after 0s [id=562651023]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```
</details>

</details>